# Programa√ß√£o L√≥gica ‚Äì Prolog

## üìö Parte Te√≥rica

### ‚úÖ Pontos compreendidos

---

**Vari√°vel an√¥nima (`_`)**  
- Usada como *placeholder*, quando o valor em si n√£o importa, apenas a posi√ß√£o.  
- Evita criar vari√°veis que n√£o ser√£o utilizadas.  

Exemplo:  
```prolog
?- casa(_, azul, _) = casa(bob, azul, gato).
true.
```

---

**Predicado `nextto/3`**  
- Usado para verificar se dois elementos s√£o consecutivos em uma lista.  

Exemplo:  
```prolog
?- nextto(b,c,[a,b,c,d]).
true.

?- nextto(b,X,[a,b,1,a,b,2]).
X = 1 ;
X = 2 ;
false.
```

---

**Predicado `select/3` e `select/4`**  
- `select/3`: remove ou identifica um elemento de uma lista.  
- `select/4`: substitui um elemento antigo por um novo em uma lista.  

Exemplo:  
```prolog
% select/3 - remo√ß√£o ou identifica√ß√£o de elemento
?- select(b, [a,b,c], R).
R = [a, c].

?- select(X, [a,b,c], [a,c]).
X = b.

?- select(X, [a,b,c], Y).
X = a, Y = [b, c] ;
X = b, Y = [a, c] ;
X = c, Y = [a, b].

% select/4 - substitui√ß√£o de elemento
?- select(b, [a,b,c], x, R).
R = [a, x, c].

?- select(X, [a,b,c], y, R).
X = a, R = [y, b, c] ;
X = b, R = [a, y, c] ;
X = c, R = [a, b, y].
```

---

### ‚ùå Pontos n√£o compreendidos

**Predicado `findall/3`**  
Inicialmente confuso, mas o entendimento melhorou com este exemplo:  

```prolog
happening(monday,chemistry).
happening(monday,english).
happening(tuesday,chemistry).
happening(wednesday,maths).
happening(friday,chemistry).
happening(friday,maths).

find_lessons(Bag) :- findall(X, happening(X,chemistry), Bag).
```

Consulta:  
```prolog
?- find_lessons(Bag).
Bag = [monday, tuesday, friday].
```

Aqui, `findall/3` coleta todos os valores poss√≠veis de `X` que satisfazem a condi√ß√£o `happening(X, chemistry)` e retorna a lista completa em `Bag`.  

---

**Uso de `trace`**  
- trace/0
   - Inicia o rastreador e o sinaliza, posterior tra√ßa o pr√≥ximo objetivo.
- tracing/0
   - Mostra se o rastreador est√° atualmente ligado.
- notrace/0
   - Para o rastreador
- trace(+Pred)
   - Coloca um ponto de rastreamento em todos os predicados correspondentes.
- trace(+Pred, +Ports)
   - Coloca pontos de rastreamentos em predicados e portas espec√≠ficas.

- As portas:
   - Call:  quando o Prolog tenta provar um objetivo.
   - Exit: quando o Prolog prova com sucesso um objetivo.
   - Redo: quando o Prolog volta atr√°s (backtracking) para buscar novas solu√ß√µes.
   - Fail: quando o Prolog n√£o consegue provar o objetivo.

Exemplo de sa√≠da:  
```prolog
?- trace, member(X,[a,b]).
   Call: (10) member(_G123,[a,b]) ?
   Exit: (10) member(a,[a,b]) ?
X = a ;
   Redo: (10) member(_G123,[a,b]) ?
   Exit: (10) member(b,[a,b]) ?
X = b.
``` 

---

**Predicado list_to_set/2**  
- Converte uma lista em um conjunto, removendo elementos duplicados.

Exemplo:  
```prolog
?- L = [a, s, d, a, f, s], list_to_set(L, S).
L = [a, s, d, a, f, s],
S = [a, s, d, f].
```  

---

## üõ†Ô∏è Parte Pr√°tica

### Exerc√≠cios realizados com `movies.pl`
1. **O filme schindlers_list √© uma com√©dia?**

![Consulta 1](ex1.gif)

2. **Quais os atores (masculinos) do filme inglorious_basterds?**

![Consulta 2](ex2.gif)

3. **Quais os filmes lan√ßados na d√©cada de 80 (entre 1981 e 1990, inclusive)? Dica: veja operadores relacionais no material da aula passada.**

 ![Consulta 3](ex3.gif)

4. **Quais os atores ou atrizes do filme the_hunger_games?**
 -  Nesse fiz uma consulta pr√©via apenas para n√£o ficar repetindo o n√∫mero do filme.

 ![Consulta 4](ex4.gif)

6. **O ator brad_pitt √© um ator de drama?**

 ![Consulta 5](ex5.gif)

6. **H√° quantos anos foi lan√ßado o filme big_fish? Consulte o material da aula passada para saber como fazer opera√ß√µes aritm√©ticas em Prolog.**

 ![Consulta 6](ex6.gif)

7. **O ator liam_neeson √© um ator de com√©dia?**

 ![Consulta 7](ex7.gif)
 

---

### Regras adicionadas no arquivo `movies.pl`

- `drama_artist(A)` ‚Üí verdadeiro se `A` for ator ou atriz de um filme de drama.  
- `movieAgeByName(M, Age)` ‚Üí retorna a idade do filme `M` em anos, calculada a partir do ano atual.  

![Adi√ß√£o das regras](adicionaRegra12.gif)

---

### Consultas com listas

**G√™neros de filmes da base:**  
```prolog
?- allgenres(G).
G = [dark_comedy, psychological_thriller, drama ...].
```

**Primeiro g√™nero da lista:**  
```prolog
?- allgenres(G), G = [H | _].
H = dark_comedy.
```
- O s√≠mbolo | √© o operador de separa√ß√£o entre o head (cabe√ßa) e o tail (cauda) de uma lista e, neste caso, est√° dizendo: pegue o primeiro g√™nero em H e ignore o resto (_).

**Quantidade de g√™neros distintos:**  
```prolog
?- countgenres(C).
C = 39.
```

![Consulta com Lista](consultaComLista.gif)

---

** Adicione regra com lista**

```prolog
count_users(Qtd) :- findall(U, likes(U, _), Users),
     list_to_set(Users, Uniq),
     length(Uniq, Qtd).
```

## üìñ Refer√™ncias Bibliogr√°ficas

- https://stackoverflow.com/questions/64223921/how-do-i-write-findall-in-a-prolog-code-itself
- https://www.swi-prolog.org/pldoc/man?section=lists
- https://www.ic.unicamp.br/~meidanis/courses/mc600/200002/Manual-Prolog/sec-3.39.html
- https://www.swi-prolog.org/pldoc/man?predicate=list_to_set/2
